const 大前端 = [{
    title: "JavaScript",
    children: [
      ['01.Javascript/01.正则表达式.md', '正则表达式🐣'],
      ['01.Javascript/02.函数式编程.md', '函数式编程🐓'],
      ['01.Javascript/03.什么是闭包.md', '什么是闭包🐢'],
      ['01.Javascript/04.map、reduce、filter、for...of、for...in等总结.md', 'map、reduce等总结🐥'],
    ],
  },
  {
    title: "ES6",
    children: [
      ['02.ES6/01.ES6.md', 'ES6🐳'],
    ],
  },
  // {
  //   title: "Vue",
  //   collapsable: false,
  //   children: [
  //     ['03.Vue/01.混入.md', '混入函数'],
  //   ],
  // },
  // {
  //   title: "React",
  //   collapsable: false,
  //   children: [
  //     ['04.React/01.React小技巧.md', 'React小技巧'],
  //   ],
  // },
];
const 前端 = [{
  title: "JavaScript",
  collapsable: false,
  children: [
    ['javascript/JavaScript创建对象的方法.md', 'JavaScript创建对象的方法'],
    ['javascript/JS实现异步编程的4种方法.md', 'JS实现异步编程的4种方法'],
    ['javascript/前端工程化的理解.md', '前端工程化的理解'],
    ['javascript/2020-07-17-深拷贝与函数只执行一次.md', '深拷贝与函数只执行一次'],
    ['javascript/2020-07-17-JS原型与原型链.md', 'JS原型与原型链'],
    ['javascript/2020-07-17-函数节流与防抖.md', '函数节流与防抖'],
    ['javascript/2020-07-17-实现私有方法.md', '实现私有方法'],
    ['javascript/2020-07-18-String()，new-String()以及单引号与双引号.md', 'String()，new-String()以及单引号与双引号'],
    ['javascript/2020-07-21-函数柯里化.md', '函数柯里化'],
    ['javascript/2020-07-21-Object.defineProperty之数据劫持.md', 'Object.defineProperty之数据劫持'],
    ['javascript/2020-07-21-利用Proxy实现数据绑定.md', '利用Proxy实现数据绑定'],
    ['javascript/2020-07-21-自定义arr.slice方法.md', '自定义arr.slice方法'],
    ['javascript/2020-07-22-使用defineProperty实现Proxy.md', '使用defineProperty实现Proxy'],
    ['javascript/2020-08-01-Array.prototype.reduce用法.md', 'Array.prototype.reduce用法'],
    ['javascript/2020-08-01-Array.prototype.filter用法.md', 'Array.prototype.filter用法'],
    ['javascript/2020-08-01-3种版本的ajax封装.md', '3种版本的ajax封装'],
    ['javascript/2020-08-01-生成器.md', '生成器'],
    ['javascript/2020-08-01-Promise简单实现.md', 'Promise简单实现'],
    ['javascript/2020-08-02-js中的继承.md', 'js中的继承'],
  ]
}];



const 深度学习 = [{
    title: "深度学习",
    collapsable: false,
    children: [
      ['01.深度学习的介绍.md', '深度学习介绍']
    ],
  }
];
const 个人简介 = [{
  title: "简介",
  collapsable: false,
  children: [
    ['MyProfile.md', '个人简介']
  ],
}];
const Vuejs = [{
  title: "Vuejs",
  collapsable: false,
  children: [
    ['2020-08-08-实现基础的Vuejs.md', '实现基础的Vuejs']
  ],
}];
const 前端体系interview总结 = [{
  title: "前端体系interview总结",
  collapsable: false,
  children: [
    ['前端体系interview总结.md', '前端体系interview总结']
  ],
}];
const 计算机网络 = [{
  title: "计算机网络",
  collapsable: false,
  children: [
    ['2020-07-13-数字签名是什么？.md', '数字签名是什么？'],
    ['2020-07-27-为什么TCP是可靠的？.md', '为什么TCP是可靠的？']
  ],
}];
const 秋招小记 = [{
  title: "秋招小记",
  collapsable: false,
  children: [
    ['秋招小记.md', '秋招小记']
  ],
}];
const LeetCode = [{
    title: "每日一题",
    collapsable: false,
    children: [
      ['2020-7-7.md', '第一题'],
      ['2020-7-8.md', '第二题'],
      ['2020-7-9.md', '第三题'],
      ['2020-7-9(2).md', '第四题'],
      ['2020-7-10.md', '第五题'],
      ['2020-7-11-斐波那契数列.md', '斐波那契数列'],
      ['2020-7-11-青蛙跳台阶问题.md', '青蛙跳台阶问题'],
      ['2020-7-11-旋转数组的最小数字.md', '旋转数组的最小数字'],
      ['2020-7-11-二进制中1的个数.md', '二进制中1的个数'],
      ['2020-7-11-打印从1到最大的n位数.md', '打印从1到最大的n位数'],
      ['2020-7-11-删除链表的节点.md', '删除链表的节点'],
      ['2020-7-11-调整数组顺序使奇数位于偶数前面.md', '调整数组顺序使奇数位于偶数前面'],
      ['2020-7-11-链表中倒数第k个节点.md', '链表中倒数第k个节点'],
      ['2020-7-11-反转链表.md', '反转链表'],
      ['2020-7-11-合并两个排序的链表.md', '合并两个排序的链表'],
      ['2020-7-12-从上到下打印二叉树-II.md', '从上到下打印二叉树-II'],
      ['2020-7-12-第一个只出现一次的字符.md', '第一个只出现一次的字符'],
      ['2020-7-12-二叉树的镜像.md', '二叉树的镜像'],
      ['2020-7-12-两个链表的第一个公共节点.md', '两个链表的第一个公共节点'],
      ['2020-7-13-0～n-1中缺失的数字.md', '0～n-1中缺失的数字'],
      ['2020-7-13-翻转单词顺序.md', '翻转单词顺序'],
      ['2020-7-13-和为s的两个数字.md', '和为s的两个数字'],
      ['2020-7-13-在排序数组中查找数字-I.md', '在排序数组中查找数字-I'],
      ['2020-7-13-II.-左旋转字符串.md', 'II.-左旋转字符串'],
      ['2020-07-17-n个骰子的点数.md', 'n个骰子的点数'],
      ['2020-07-13-I.-滑动窗口的最大值.md', 'I.-滑动窗口的最大值'],
      ['2020-07-17-扑克牌中的顺子.md', '扑克牌中的顺子'],
      ['2020-07-26-求1+2+…+n.md', '求1+2+…+n'],
      ['2020-07-26-I.-二叉树的深度.md', 'I.-二叉树的深度'],
      ['2020-07-28-约瑟夫环.md', '约瑟夫环'],
    ],
  }
];


module.exports = {
  '/前端/': 前端,
  '/深度学习/': 深度学习,
  '/简介/':个人简介,
  '/LeetCode/': LeetCode,
  '/秋招小记/': 秋招小记,
  '/计算机网络/': 计算机网络,
  '/Vuejs/': Vuejs,
  '/前端体系interview总结/': 前端体系interview总结
}